<?php
//CMS language file, DO NOT modify me!
//Created on 2005-09-04 13:36:36

$_LANG_SKIN = array (
  'tpl_cate_add' => '新增模板分类',
  'parent_cate_name' => '父分类',
  'cate_name' => '分类名称',
  'PermissionSetting' => '权限设置',
  'ReadG' => '读权限-用户组',
  'WriteG' => '写权限-用户组',
  'src_group' => '用户组',
  'select_all' => '全选',
  'del_all' => '全删',
  'select_group' => '选定组',
  'src_user' => '用户',
  'select_user' => '选定用户',
  'ReadU' => '读权限-用户',
  'WriteU' => '写权限-用户',
  'inherit' => '继承父分类权限',
'help_message' => '<UL><li>读权限：浏览模板、使用模板 </li><li>写权限：新增、修改、删除模板</li><li>管理权限：具有分类管理权限的用户具有分类的完全控制权，包括分类参数的设置、权限的分配，分类下模板的新增、修改、删除，同时具备创建子分类的权利</li><li>用户权限优先于用户组权限,一般设置用户组权限即可,用户权限用于用户级的细粒度权限控制.</li><li>继承父分类权限：通过继承父分类的权限，可以简化分类权限设置，方便多个亲缘分类的权限管理。这种继承是可以递归的，也就是说如果父分类也是继承父分类权限，子分类就递归继承父分类的父分类（祖父分类）的权限，以此类推。</li><li>分类的创建人具有分类的原始控制权（可实现分类子管理员功 能），该原始控制权不受分类权限设置的影响。</li><li>系统管理员具有所有控制权限</li></UL>',  'mode_ManageG' => '管理权限-用户组',
  'mode_ManageU' => '管理权限-用户',
);
?>