<?php


/**
 +-----------------------------------------------------------------------------+
 * THChat全局文件		|GLOBAL.PHP|
 +-----------------------------------------------------------------------------+
 * @copyright  Copyright (c) 2007 www.zzye.com.cn  All rights reserved. 
 * @author     Cupdir <Cupdir@gmail.com>
 * @version    1.0
 +-----------------------------------------------------------------------------+
 */






#--------------------------------------------------------------+
#error_reporting函数作用|净化新鲜空气|
#常量CUPDIR|调用文件必须先经过这里|
#常量ONLINE|显示在线人数|
#--------------------------------------------------------------+
error_reporting(0);
header("content-Type: text/html; charset=gb2312");
header("Expires: Mon, 26 Jul 1997 05:00:00 GMT");
header("Cache-Control: no-cache, must-revalidate");
header("Pragma: no-cache");
#--------------------------------------------------------------+
define('CUPDIR',true);
define('ONLINE','20');
#--------------------------------------------------------------+



#--------------------------------------------------------------+
				#---加载所有的驱动文件--#
#--------------------------------------------------------------+
include_once(dirname(__FILE__).'/./require/config.php');
include_once(dirname(__FILE__).'/./lib/UserInfo_Class.php');
include_once(dirname(__FILE__).'/./lib/Mysql_DB_class.php');
include_once(dirname(__FILE__).'/./lib/UserLogin_Class.php');
include_once(dirname(__FILE__).'/./lib/Mess_Class.php');
#--------------------------------------------------------------+




#------------------------------------------------------------------------+
#					--创建数据库对象--
#------------------------------------------------------------------------+
$DB = new DB_MySQL();
$mysql = $DB->connect($mysql_host,$mysql_user,$mysql_pass,$mysql_dbname);
#------------------------------------------------------------------------+




#------------------------------------------------------------------------+
#					--设置数据库编码类型--
#------------------------------------------------------------------------+
if( $DB->version() > "4.1" )
{
	$DB->query("SET NAMES 'gbk'");
}
#------------------------------------------------------------------------+
?>
