<?php


/**
 +-----------------------------------------------------------------------------+
 * THChat公共文件		|UserLogin.PHP|	用户登陆模块
 +-----------------------------------------------------------------------------+
 * @copyright  Copyright (c) 2007 www.zzye.com.cn  All rights reserved. 
 * @author     Cupdir <Cupdir@gmail.com>
 * @version    1.0
 +-----------------------------------------------------------------------------+
 */





#-----------------------------------------------+
//|加载全局变量及类库|dirname|函数得到当前路径|
#-----------------------------------------------+
include_once(dirname(__FILE__).'/./global.php'); 
#-----------------------------------------------+

if(isset($_GET['do']) && trim($_GET['do']) == "login") 
{
	#--------------------------------------------------------------+
	//addslashes|函数作用是查询数据库中的单引号、双引号、反斜线、NULL 字符|
	//strtolower|函数作用是将大写字符串转换为小写|
	#--------------------------------------------------------------+
	$LoginName 	= addslashes(strtolower(trim($_POST['username'])));
	$LoginPass 	= md5(addslashes(trim($_POST['password'])));       
	#--------------------------------------------------------------+
}

	#---------------------------------------------------------------+
	//创建一个登陆对象UserLogin()方法,引用|LIB|UserLogin_Class.php类
	#---------------------------------------------------------------+
	$UserLogin	=	new UserInfo_Class();
	$UserLogin	-> 	UserLogin($LoginName,$LoginPass);
	#---------------------------------------------------------------+
?>
