<?php


/**
 +-----------------------------------------------------------------------------+
 * THChat公共文件		|UserReg.PHP|	用户注册模块
 +-----------------------------------------------------------------------------+
 * @copyright  Copyright (c) 2007 www.zzye.com.cn  All rights reserved. 
 * @author     Cupdir <Cupdir@gmail.com>
 * @version    1.0
 +-----------------------------------------------------------------------------+
 */





#-----------------------------------------------+
//|加载全局变量及类库|dirname|函数得到当前路径|
#-----------------------------------------------+
include_once(dirname(__FILE__).'/./global.php'); 
#-----------------------------------------------+


#---------------------------------------------------------------+
//创建一个注册对象UserReg()方法,引用|LIB|UserInfo_Class.php类
#---------------------------------------------------------------+
$UserReg	=	new UserInfo_Class();
#---------------------------------------------------------------+

	#--------------------------------------------------------------+
	//addslashes|函数作用是查询数据库中的单引号、双引号、反斜线、NULL 字符|
	//strtolower|函数作用是将大写字符串转换为小写|
	#--------------------------------------------------------------+
	$RegName 	= addslashes(strtolower(trim($_POST['username'])));
	$RegPass 	= trim($_POST['password']);
	#--------------------------------------------------------------+

	
if(isset($_GET['do']) && trim($_GET['do']) == "reg"){
   
	
	$UserReg	-> 	UserReg($RegName,$RegPass,$new_user_open);

}

if(isset($_GET['do']) && trim($_GET['do']) == "user" ){
	
	$UserReg	->	Overuser($RegName);
}



	
	
	#---------------------------------------------------------------+